index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-06 Sun 16:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Arkboi's Blog</title>
<meta name="author" content="Arkboi" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Arkboi's Blog</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbdbbd3e">1. Hello World</a>
<ul>
<li><a href="#org759c4a5">1.1. Dark Mode</a></li>
<li><a href="#org158625f">1.2. What I do here</a></li>
</ul>
</li>
<li><a href="#org8bb21d0">2. Whats Bad About: Hyprland</a>
<ul>
<li><a href="#orgad38e50">2.1. Hyprland is slow.</a></li>
<li><a href="#org5c8b0e5">2.2. Alternatives</a></li>
<li><a href="#org5534e8a">2.3. Conclusion</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbdbbd3e" class="outline-2">
<h2 id="orgbdbbd3e"><span class="section-number-2">1.</span> Hello World</h2>
<div class="outline-text-2" id="text-1">
<p>
Writing a blog in org mode is the most emacs i can get, You get to suffer HTML, CSS and JS BS in VSCODE while I
get to enjoy writing notes in "markdown but with serious steroids" and convert it into a site.
</p>
</div>
<div id="outline-container-org759c4a5" class="outline-3">
<h3 id="org759c4a5"><span class="section-number-3">1.1.</span> Dark Mode</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The site does have a dark mode, it is using the Retro Dark org theme. (<a href="https://gitlab.com/OlMon/org-themes/-/blob/master/src/retro_dark/retro_dark.theme">https://gitlab.com/OlMon/org-themes/-/blob/master/src/retro_dark/retro_dark.theme</a>)
</p>
</div>
</div>
<div id="outline-container-org158625f" class="outline-3">
<h3 id="org158625f"><span class="section-number-3">1.2.</span> What I do here</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This site will probably be filled with lots and lots of rants. So have fun!
</p>
</div>
</div>
</div>
<div id="outline-container-org8bb21d0" class="outline-2">
<h2 id="org8bb21d0"><span class="section-number-2">2.</span> Whats Bad About: Hyprland</h2>
<div class="outline-text-2" id="text-2">
<p>
Hyprland, a Wayland compositor is just simply bad.
</p>

<p>
There is an alternative with all it's features but minus the drama that comes along with Hyprland.
</p>

<p>
Have a quick read through this:
</p>

<p>
<a href="https://rentry.co/Hyprland-controversy">https://rentry.co/Hyprland-controversy</a>
</p>

<p>
as well as Drew's blog about it:
</p>

<p>
<a href="https://drewdevault.com/2023/09/17/Hyprland-toxicity.html">https://drewdevault.com/2023/09/17/Hyprland-toxicity.html</a>
</p>

<p>
This is all about the Hyprland lead developer vaxry and the Hyprland community.
</p>
</div>
<div id="outline-container-orgad38e50" class="outline-3">
<h3 id="orgad38e50"><span class="section-number-3">2.1.</span> Hyprland is slow.</h3>
<div class="outline-text-3" id="text-2-1">
<p>
It has performed really, and I mean really bad on my computer, and sometimes gets in this state
where its unusable, you have to reboot
</p>

<p>
and if a program forces me to reboot, im running it over
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo pacman -Runs hyprland
</pre>
</div>
</div>
</div>
<div id="outline-container-org5c8b0e5" class="outline-3">
<h3 id="org5c8b0e5"><span class="section-number-3">2.2.</span> Alternatives</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The best alternative to hyprland is:
</p>

<p>
<a href="https://github.com/nferhat/fht-compositor">https://github.com/nferhat/fht-compositor</a>
</p>

<p>
the fht compositor has all your eye candy features, without any drama, and it runs well.
</p>

<p>
It's also worth considering:
</p>

<ul class="org-ul">
<li>Niri (<a href="https://github.com/YaLTeR/niri">https://github.com/YaLTeR/niri</a>) (The one I use, a scrollable Wayland compositor.)</li>

<li>River (<a href="https://isaacfreund.com/software/river/">https://isaacfreund.com/software/river/</a>) (Similar to DWM, Xmonad, etc)</li>

<li>Sway (<a href="https://swaywm.org">https://swaywm.org</a>) (i3 compatible Wayland compositor)</li>
</ul>
</div>
</div>
<div id="outline-container-org5534e8a" class="outline-3">
<h3 id="org5534e8a"><span class="section-number-3">2.3.</span> Conclusion</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Do not use Hyprland, if you ever shilled it, make an apology
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arkboi</p>
<p class="date">Created: 2025-04-06 Sun 16:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
